In [35]:
import pandas as pd

In [36]:
train = pd.read_csv('titanic/train.csv', index_col = 'PassengerId')
test = pd.read_csv('titanic/test.csv', index_col = 'PassengerId')

In [37]:
print('train shape: ', train.shape)
print('test shape: ', test.shape)

train shape:  (891, 11)
test shape:  (418, 10)

In [38]:
train.drop('Cabin', axis = 1, inplace = True )
test.drop('Cabin', axis = 1, inplace = True)

In [39]:
train.drop(['Name', 'Ticket'], axis = 1, inplace = True)
test.drop(['Name', 'Ticket'], axis = 1, inplace = True)

In [40]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.6+ KB

In [41]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [42]:
train['Embarked'].fillna('S', inplace = True)

In [43]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.6+ KB

In [44]:
train.dropna(inplace = True)

In [45]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 1 to 891
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  714 non-null    int64
 1   Pclass    714 non-null    int64
 2   Sex       714 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     714 non-null    int64
 5   Parch     714 non-null    int64
 6   Fare      714 non-null    float64
 7   Embarked  714 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 50.2+ KB

In [46]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       332 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      417 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 26.1+ KB

In [47]:
test['Fare'].fillna(test['Fare'].mean(), inplace = True)

In [48]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       332 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 26.1+ KB

In [49]:
test['Age'].fillna(test['Age'].mean(), inplace = True)

In [50]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 26.1+ KB

In [51]:
train['IsAlone'] = (train['SibSp'] + train['Parch']) <= 0
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,IsAlone
PassengerId,,,,,,,,,
1,0,3,male,22.0,1,0,7.2500,S,False
2,1,1,female,38.0,1,0,71.2833,C,False
3,1,3,female,26.0,0,0,7.9250,S,True
4,1,1,female,35.0,1,0,53.1000,S,False
5,0,3,male,35.0,0,0,8.0500,S,True

In [52]:
train.IsAlone = train.IsAlone.map({True : 1, False : 0})
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,IsAlone
PassengerId,,,,,,,,,
1,0,3,male,22.0,1,0,7.2500,S,0
2,1,1,female,38.0,1,0,71.2833,C,0
3,1,3,female,26.0,0,0,7.9250,S,1
4,1,1,female,35.0,1,0,53.1000,S,0
5,0,3,male,35.0,0,0,8.0500,S,1

In [53]:
test['IsAlone'] = (test['SibSp'] + test['Parch']) <= 0
test.head()

             Pclass     Sex   Age  SibSp  Parch     Fare Embarked  IsAlone
PassengerId
892               3    male  34.5      0      0   7.8292        Q     True
893               3  female  47.0      1      0   7.0000        S    False
894               2    male  62.0      0      0   9.6875        Q     True
895               3    male  27.0      0      0   8.6625        S     True
896               3  female  22.0      1      1  12.2875        S    False

In [54]:
test.IsAlone = test.IsAlone.map({True : 1, False : 0})
test.head()

             Pclass     Sex   Age  SibSp  Parch     Fare Embarked  IsAlone
PassengerId
892               3    male  34.5      0      0   7.8292        Q        1
893               3  female  47.0      1      0   7.0000        S        0
894               2    male  62.0      0      0   9.6875        Q        1
895               3    male  27.0      0      0   8.6625        S        1
896               3  female  22.0      1      1  12.2875        S        0

In [55]:
DictSex = {'female' : 0, 'male' : 1 }
DictEmbarked = {'C' : 0, 'Q' : 1, 'S' : 2 }

train.Sex = train.Sex.map(DictSex)
train.Embarked = train.Embarked.map(DictEmbarked)

test.Sex = test.Sex.map(DictSex)
test.Embarked = test.Embarked.map(DictEmbarked)

In [56]:
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,IsAlone
PassengerId,,,,,,,,,
1,0,3,1,22.0,1,0,7.2500,2,0
2,1,1,0,38.0,1,0,71.2833,0,0
3,1,3,0,26.0,0,0,7.9250,2,1
4,1,1,0,35.0,1,0,53.1000,2,0
5,0,3,1,35.0,0,0,8.0500,2,1

In [57]:
test.head()

             Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  IsAlone
PassengerId
892               3    1  34.5      0      0   7.8292         1        1
893               3    0  47.0      1      0   7.0000         2        0
894               2    1  62.0      0      0   9.6875         1        1
895               3    1  27.0      0      0   8.6625         2        1
896               3    0  22.0      1      1  12.2875         2        0

In [58]:
features = ['IsAlone', 'Embarked', 'Fare', 'Parch', 'SibSp', 'Age', 'Sex', 'Pclass']

X = train[features]
y = train['Survived']

test_X = test[features]

In [59]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 88)

In [68]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_absolute_error 

model = RandomForestRegressor(bootstrap = True, max_depth = 7, max_features = 'sqrt', min_samples_leaf = 9, min_samples_split = 6, n_estimators = 10, n_jobs = -1, random_state = 88, warm_start = False)

model.fit(x_train, y_train)
pred_y = model.predict(x_test)
pred_y = pred_y.round(0).astype(int)

mean_absolute_error(y_test, pred_y)

0.2517482517482518

In [69]:
predict_test_y = model.predict(test_X)
predict_test_y = predict_test_y.round(0).astype(int)

In [70]:
print('Training Score: ', model.score(x_train, y_train))
print('Testing Score: ', model.score(x_test, y_test))

Training Score:  0.5027262847935747
Testing Score:  0.32364724002360823

In [71]:
output = pd.DataFrame({'PassengerId': test.index, 'Survived': predict_test_y})
output.to_csv('titanic/submission.csv', index = False)